app/controllers/application_controller.rb

SELECT "INTERNAL_POSITIONS".* FROM "INTERNAL_POSITIONS" WHERE "INTERNAL_POSITIONS"."NAME" = :a1 AND ROWNUM <= :a2   [["name", "SUPERADMIN"], ["LIMIT", 1]]
---
    def authorize_action
        if !current_user.nil? && params[:controller] != 'devise/sessions'
            #TODO INTEGRAR FILTRO POR UNIDAD
            if current_user.cargo_principal===InternalPosition.find_by_name("SUPERADMIN")