app/controllers/internal_positions_controller.rb

SELECT "INTERNAL_POSITIONS".* FROM "INTERNAL_POSITIONS"
---
  def index
    @internal_positions = InternalPosition.all

SELECT "INTERNAL_POSITIONS".* FROM "INTERNAL_POSITIONS" WHERE "INTERNAL_POSITIONS"."ID" = :a1 AND ROWNUM <= :a2   [["id", 1], ["LIMIT", 1]]
---
    def set_internal_position
      @internal_position = InternalPosition.find(params[:id])