app/controllers/users_controller.rb

def index
  @users = User.all
---
SELECT "USERS".* FROM "USERS"

def asignar_cargo
  nombre_cargo=InternalPosition.find(params[:internal_position_id]).name
  respond_to do |format|
    format.json {
      usuario= User.asignar_cargo(params[:email],params[:rut],params[:full_name],nombre_cargo)
      if !usuario.nil?
        if !usuario.id.blank?
---
SELECT "INTERNAL_POSITIONS".* FROM "INTERNAL_POSITIONS" WHERE "INTERNAL_POSITIONS"."ID" = :a1 AND ROWNUM <= :a2   [["id", 3], ["LIMIT", 1]]
SELECT "USERS".* FROM "USERS" WHERE "USERS"."EMAIL" = :a1 AND ROWNUM <= :a2   [["email", "correoseis@usach.cl"], ["LIMIT", 1]]
SELECT 1 AS one FROM "USERS" WHERE "USERS"."EMAIL" = :a1 AND "USERS"."ID" != :a2 AND ROWNUM <= :a3   [["email", "correoseis@usach.cl"], ["id", 11], ["LIMIT", 1]]

  def set_user
    @user = User.find(params[:id])
---
SELECT "USERS".* FROM "USERS" WHERE "USERS"."ID" = :a1 AND ROWNUM <= :a2   [["id", nil], ["LIMIT", 1]]