app/models/internal_position.rb

  def has_permission?(permiso,unidad=nil)
    if unidad.nil?
      InternalPositionPermission.where(internal_position:self,permission:permiso,unit:nil).exists?
---
SELECT 1 AS one FROM "INTERNAL_POSITION_PERMISSIONS" WHERE "INTERNAL_POSITION_PERMISSIONS"."INTERNAL_POSITION_ID" = :a1 AND "INTERNAL_POSITION_PERMISSIONS"."PERMISSION_ID" = :a2 AND "INTERNAL_POSITION_PERMISSIONS"."UNIT_ID" IS NULL AND ROWNUM <= :a3   [["internal_position_id", 1], ["permission_id", 117], ["LIMIT", 1]]