app/models/user.rb

SELECT "INTERNAL_POSITIONS".* FROM "INTERNAL_POSITIONS" WHERE "INTERNAL_POSITIONS"."ID" = :a1 AND ROWNUM <= :a2   [["id", 1], ["LIMIT", 1]]
---
  def cargo_principal
    if active_profile.nil?
      self.internal_positions.first
    else
      InternalPosition.find(active_profile)

SELECT "USERS".* FROM "USERS" WHERE "USERS"."EMAIL" = :a1 AND ROWNUM <= :a2   [["email", "correoseis@usach.cl"], ["LIMIT", 1]]
INSERT INTO "USERS" ("EMAIL", "ENCRYPTED_PASSWORD", "FULL_NAME", "CREATED_AT", "UPDATED_AT", "RUT", "ID") VALUES (:a1, :a2, :a3, :a4, :a5, :a6, :a7)
SELECT "INTERNAL_POSITIONS".* FROM "INTERNAL_POSITIONS" WHERE "INTERNAL_POSITIONS"."NAME" = :a1 AND ROWNUM <= :a2   [["name", "USUARIONORMAL"], ["LIMIT", 1]]
SELECT 1 AS one FROM "USERS" WHERE "USERS"."EMAIL" = :a1 AND ROWNUM <= :a2   [["email", "correoseis@usach.cl"], ["LIMIT", 1]]
SELECT 1 AS one FROM "USER_INTERNAL_POSITIONS" WHERE "USER_INTERNAL_POSITIONS"."USER_ID" = :a1 AND "USER_INTERNAL_POSITIONS"."INTERNAL_POSITION_ID" = :a2 AND ROWNUM <= :a3   [["user_id", 11], ["internal_position_id", 3], ["LIMIT", 1]]
INSERT INTO "USER_INTERNAL_POSITIONS" ("USER_ID", "INTERNAL_POSITION_ID", "CREATED_AT", "UPDATED_AT", "ID") VALUES (:a1, :a2, :a3, :a4, :a5)  [["user_id", 11], ["internal_position_id", 3], ["created_at", "2022-11-08 20:29:22.870973"], ["updated_at", "2022-11-08 20:29:22.870973"], ["id", 11]]
UPDATE "USERS" SET "UPDATED_AT" = :a1, "ACTIVE_PROFILE" = :a2 WHERE "USERS"."ID" = :a3  [["updated_at", "2022-11-08 20:29:22.894919"], ["active_profile", 11], ["id", 11]]
---
  def self.asignar_cargo(correo,auxrut,nombre,nombre_cargo,unidad=nil)
    #TODO INTEGRAR CARGO CON UNIDAD
    #unless unidad.nil?
    #  unidad = Unit.find_by_name(unidad).id
    #end
    if User.find_by_email(correo)
      usuario = User.find_by_email(correo)
    else
      password_length = 16
      password = Devise.friendly_token.first(password_length)
      usuario =  User.new(email: correo, password: password, rut: auxrut, full_name: nombre)
      usuario.save!
    end
    cargo = InternalPosition.find_by_name(nombre_cargo)
    if !usuario.blank? && !cargo.blank?
      if UserInternalPosition.exists?(user:usuario,internal_position:cargo)
        user_internal_position = UserInternalPosition.where(user:usuario,internal_position:cargo).first
      else
        user_internal_position = UserInternalPosition.new(user:usuario,internal_position:cargo)
        user_internal_position.save
      end
      usuario.update!(active_profile:user_internal_position.id)

SELECT * FROM (SELECT "PERMISSIONS".* FROM "PERMISSIONS" WHERE "PERMISSIONS"."SUBJECT_CLASS" = :a1 AND "PERMISSIONS"."ACTION" = :a2 ORDER BY "PERMISSIONS"."ID" ASC ) WHERE ROWNUM <= :a3  [["subject_class", "User"], ["action", "index"], ["LIMIT", 1]]
SELECT * FROM (SELECT "PERMISSIONS".* FROM "PERMISSIONS" WHERE "PERMISSIONS"."SUBJECT_CLASS" = :a1 AND "PERMISSIONS"."ACTION" = :a2 ORDER BY "PERMISSIONS"."ID" ASC ) WHERE ROWNUM <= :a3  [["subject_class", "User"], ["action", "manage"], ["LIMIT", 1]]
SELECT * FROM (SELECT "PERMISSIONS".* FROM "PERMISSIONS" WHERE "PERMISSIONS"."SUBJECT_CLASS" = :a1 AND "PERMISSIONS"."ACTION" = :a2 ORDER BY "PERMISSIONS"."ID" ASC ) WHERE ROWNUM <= :a3  [["subject_class", "all"], ["action", "manage"], ["LIMIT", 1]]
---
  def has_permission?(nombre_tabla,nombre_accion,unidad)
    permiso = Permission.where(subject_class: nombre_tabla,action: nombre_accion).first_or_initialize
    permiso_manage = Permission.where(subject_class: nombre_tabla,action: "manage").first_or_initialize
    permiso_super_usuario = Permission.where(subject_class: "all",action: "manage").first_or_initialize